---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelFloorProjection
source: html/b2a57fe1-b88a-cab6-9efa-5c6d832922bb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelFloorProjection Property

"z Projection"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelFloorProjection { get; }
```